Revit 2026 API

# WorksetConfigurationClose Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Close(
	IList<WorksetId> worksetsToClose
)
```
```vb
Public Sub Close (
	worksetsToClose As IList(Of WorksetId)
)
```
```cpp
public:
void Close(
	IList<WorksetId^>^ worksetsToClose
)
```
```fsharp
member Close :
        worksetsToClose : IList<WorksetId> -> unit
```

#### Parameters

worksetsToClose IListWorksetId

#### Reference

WorksetConfiguration Class

Autodesk.Revit.DB Namespace